RT-Thread-Studio/sdk-csp-gd32h7/libraries/GD32H75E_standard_peripheral/Source/gd32h75e_timer.c
/*!
    \file    gd32h75e_timer.c
    \brief   TIMER driver

    \version 2025-08-07, V1.2.0, firmware for GD32H75E
*/

/*
    Copyright (c) 2025, GigaDevice Semiconductor Inc.

    Redistribution and use in source and binary forms, with or without modification,
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice,
       this list of conditions and the following disclaimer in the documentation
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors
       may be used to endorse or promote products derived from this software without
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT,
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY
OF SUCH DAMAGE.
*/

#include "gd32h75e_timer.h"

/* TIMER init parameter mask */
#define ALIGNEDMODE_MASK            ((uint32_t)0x00000060U)   /*!< TIMER init parameter aligne dmode mask */
#define COUNTERDIRECTION_MASK       ((uint32_t)0x00000010U)   /*!< TIMER init parameter counter direction mask */
#define CLOCKDIVISION_MASK          ((uint32_t)0x00000300U)   /*!< TIMER init parameter clock division value mask */
#define TIMER_CNT_UPIFBU_MASK       ((uint32_t)0x80000000U)   /*!< the UPIFBU bit mask */

/*!
    \brief      deinit a TIMER
    \param[in]  timer_periph: TIMERx(x=0~7,14~16,22,23,40~44,50,51)
    \param[out] none
    \retval     none
*/
void timer_deinit(uint32_t timer_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_TIMER_PERIPH(timer_periph)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0001U), ERR_PERIPH);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        switch(timer_periph) {
        case TIMER0:
            /* reset TIMER0 */
            rcu_periph_reset_enable(RCU_TIMER0RST);
            rcu_periph_reset_disable(RCU_TIMER0RST);
            break;
        case TIMER1:
            /* reset TIMER1 */
            rcu_periph_reset_enable(RCU_TIMER1RST);
            rcu_periph_reset_disable(RCU_TIMER1RST);
            break;
        case TIMER2:
            /* reset TIMER2 */
            rcu_periph_reset_enable(RCU_TIMER2RST);
            rcu_periph_reset_disable(RCU_TIMER2RST);
            break;
        case TIMER3:
            /* reset TIMER3 */
            rcu_periph_reset_enable(RCU_TIMER3RST);
            rcu_periph_reset_disable(RCU_TIMER3RST);
            break;
        case TIMER4:
            /* reset TIMER4 */
            rcu_periph_reset_enable(RCU_TIMER4RST);
            rcu_periph_reset_disable(RCU_TIMER4RST);
            break;
        case TIMER5:
            /* reset TIMER5 */
            rcu_periph_reset_enable(RCU_TIMER5RST);
            rcu_periph_reset_disable(RCU_TIMER5RST);
            break;
        case TIMER6:
            /* reset TIMER6 */
            rcu_periph_reset_enable(RCU_TIMER6RST);
            rcu_periph_reset_disable(RCU_TIMER6RST);
            break;
        case TIMER7:
            /* reset TIMER7 */
            rcu_periph_reset_enable(RCU_TIMER7RST);
            rcu_periph_reset_disable(RCU_TIMER7RST);
            break;
        case TIMER14:
            /* reset TIMER14 */
            rcu_periph_reset_enable(RCU_TIMER14RST);
            rcu_periph_reset_disable(RCU_TIMER14RST);
            break;
        case TIMER15:
            /* reset TIMER15 */
            rcu_periph_reset_enable(RCU_TIMER15RST);
            rcu_periph_reset_disable(RCU_TIMER15RST);
            break;
        case TIMER16:
            /* reset TIMER16 */
            rcu_periph_reset_enable(RCU_TIMER16RST);
            rcu_periph_reset_disable(RCU_TIMER16RST);
            break;
        case TIMER22:
            /* reset TIMER22 */
            rcu_periph_reset_enable(RCU_TIMER22RST);
            rcu_periph_reset_disable(RCU_TIMER22RST);
            break;
        case TIMER23:
            /* reset TIMER23 */
            rcu_periph_reset_enable(RCU_TIMER23RST);
            rcu_periph_reset_disable(RCU_TIMER23RST);
            break;
        case TIMER40:
            /* reset TIMER40 */
            rcu_periph_reset_enable(RCU_TIMER40RST);
            rcu_periph_reset_disable(RCU_TIMER40RST);
            break;
        case TIMER41:
            /* reset TIMER41 */
            rcu_periph_reset_enable(RCU_TIMER41RST);
            rcu_periph_reset_disable(RCU_TIMER41RST);
            break;
        case TIMER42:
            /* reset TIMER42 */
            rcu_periph_reset_enable(RCU_TIMER42RST);
            rcu_periph_reset_disable(RCU_TIMER42RST);
            break;
        case TIMER43:
            /* reset TIMER43 */
            rcu_periph_reset_enable(RCU_TIMER43RST);
            rcu_periph_reset_disable(RCU_TIMER43RST);
            break;
        case TIMER44:
            /* reset TIMER44 */
            rcu_periph_reset_enable(RCU_TIMER44RST);
            rcu_periph_reset_disable(RCU_TIMER44RST);
            break;
        case TIMER50:
            /* reset TIMER50 */
            rcu_periph_reset_enable(RCU_TIMER50RST);
            rcu_periph_reset_disable(RCU_TIMER50RST);
            break;
        case TIMER51:
            /* reset TIMER51 */
            rcu_periph_reset_enable(RCU_TIMER51RST);
            rcu_periph_reset_disable(RCU_TIMER51RST);
            break;
        default:
            break;
        }
    }
}

/*!
    \brief      initialize TIMER init parameter struct with a default value
    \param[in]  initpara: init parameter struct
    \param[out] none
    \retval     none
*/
void timer_struct_para_init(timer_parameter_struct *initpara)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_VALID_POINTER(initpara)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0002U), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* initialize the init parameter struct member with the default value */
        initpara->prescaler         = 0U;
        initpara->alignedmode       = TIMER_COUNTER_EDGE;
        initpara->counterdirection  = TIMER_COUNTER_UP;
        initpara->period            = 0xFFFFFFFFFFFFFFFFU;
        initpara->clockdivision     = TIMER_CKDIV_DIV1;
        initpara->repetitioncounter = 0U;
    }
}

/*!
    \brief      initialize TIMER counter
    \param[in]  timer_periph: TIMERx(x=0~7,14~16,22,23,40~44,50,51)
    \param[in]  initpara: init parameter struct
                  prescaler: prescaler value of the counter clock, 0~65535
                  alignedmode: TIMER_COUNTER_EDGE, TIMER_COUNTER_CENTER_DOWN, TIMER_COUNTER_CENTER_UP, TIMER_COUNTER_CENTER_BOTH
                  counterdirection: TIMER_COUNTER_UP, TIMER_COUNTER_DOWN
                  period: counter auto reload value, 0~0xFFFF(TIMERx(x=0,7,14~16,40~44))
                                                     0~0xFFFFFFFF(TIMERx(x=1~6,22,23))
                                                     0~0xFFFFFFFFFFFFFFFF(TIMERx(x=50,51))
                  clockdivision: TIMER_CKDIV_DIV1, TIMER_CKDIV_DIV2, TIMER_CKDIV_DIV4(TIMERx(x=0~4,7,14~16,22,23,40~44))
                  repetitioncounter: counter repetition value, 0~0xFF, use TIMER_CREP0 register(TIMERx(x=0,7,14~16,40~44)
                                                               0xFF~0xFFFFFFFF, use TIMER_CREP1 register(TIMERx(x=0,7,14~16,40~44)
    \param[out] none
    \retval     none
*/
void timer_init(uint32_t timer_periph, timer_parameter_struct *initpara)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_TIMER_PERIPH(timer_periph)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0003U), ERR_PERIPH);
    } else if(NOT_VALID_POINTER(initpara)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0003U), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* configure the counter prescaler value */
        TIMER_PSC(timer_periph) = (uint16_t)initpara->prescaler;
    
