RT-Thread-Studio/sdk-csp-gd32h7/libraries/GD32H75E_standard_peripheral/Source/gd32h75e_timer.c
        /* configure the counter direction and aligned mode */
        if((TIMER0  == timer_periph) || (TIMER7  == timer_periph) || (TIMER1  == timer_periph) || (TIMER2  == timer_periph) || \
                (TIMER3  == timer_periph) || (TIMER4  == timer_periph) || (TIMER22 == timer_periph) || (TIMER23 == timer_periph)) {
            TIMER_CTL0(timer_periph) &= (~(uint32_t)(TIMER_CTL0_DIR | TIMER_CTL0_CAM));
            TIMER_CTL0(timer_periph) |= (uint32_t)(initpara->alignedmode & ALIGNEDMODE_MASK);
            TIMER_CTL0(timer_periph) |= (uint32_t)(initpara->counterdirection & COUNTERDIRECTION_MASK);
        }
    
        /* configure the autoreload value */
        if((TIMER50  == timer_periph) || (TIMER51  == timer_periph)) {
            TIMER_CARL(timer_periph) = (uint32_t)initpara->period;
            TIMER_CARH(timer_periph) = (uint32_t)(initpara->period >> 32U);
        } else {
            TIMER_CAR(timer_periph) = (uint32_t)initpara->period;
        }
    
        /* configure the clock division value */
        if((TIMER5 != timer_periph) && (TIMER6 != timer_periph) && (TIMER50 != timer_periph) && (TIMER51 != timer_periph)) {
            /* reset the CKDIV bit */
            TIMER_CTL0(timer_periph) &= (~(uint32_t)TIMER_CTL0_CKDIV);
            TIMER_CTL0(timer_periph) |= (uint32_t)(initpara->clockdivision & CLOCKDIVISION_MASK);
        }
    
        if((TIMER0  == timer_periph) || (TIMER7  == timer_periph) || (TIMER14 == timer_periph) || (TIMER15 == timer_periph) || \
                (TIMER16 == timer_periph) || (TIMER40 == timer_periph) || (TIMER41 == timer_periph) || (TIMER42 == timer_periph) || \
                (TIMER43 == timer_periph) || (TIMER44 == timer_periph)) {
            /* configure the repetition counter value */
            if(initpara->repetitioncounter <= 255U) {
                TIMER_CFG(timer_periph) &= (~(uint32_t)TIMER_CFG_CREPSEL);
                TIMER_CREP0(timer_periph) = (uint32_t)initpara->repetitioncounter;
            } else {
                TIMER_CFG(timer_periph) |= (uint32_t)TIMER_CFG_CREPSEL;
                TIMER_CREP1(timer_periph) = (uint32_t)initpara->repetitioncounter;
            }
        }
    
        /* generate an update event */
        TIMER_SWEVG(timer_periph) |= (uint32_t)TIMER_SWEVG_UPG;
    }
}

/*!
    \brief      enable a TIMER
    \param[in]  timer_periph: TIMERx(x=0~7,14~16,22,23,40~44,50,51)
    \param[out] none
    \retval     none
*/
void timer_enable(uint32_t timer_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_TIMER_PERIPH(timer_periph)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0004U), ERR_PERIPH);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        TIMER_CTL0(timer_periph) |= (uint32_t)TIMER_CTL0_CEN;
    }
}

/*!
    \brief      disable a TIMER
    \param[in]  timer_periph: TIMERx(x=0~7,14~16,22,23,40~44,50,51)
    \param[out] none
    \retval     none
*/
void timer_disable(uint32_t timer_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_TIMER_PERIPH(timer_periph)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0005U), ERR_PERIPH);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        TIMER_CTL0(timer_periph) &= (~(uint32_t)TIMER_CTL0_CEN);
    }
}

/*!
    \brief      enable the auto reload shadow function
    \param[in]  timer_periph: TIMERx(x=0~7,14~16,22,23,40~44,50,51)
    \param[out] none
    \retval     none
*/
void timer_auto_reload_shadow_enable(uint32_t timer_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_TIMER_PERIPH(timer_periph)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0006U), ERR_PERIPH);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        TIMER_CTL0(timer_periph) |= (uint32_t)TIMER_CTL0_ARSE;
    }
}

/*!
    \brief      disable the auto reload shadow function
    \param[in]  timer_periph: TIMERx(x=0~7,14~16,22,23,40~44,50,51)
    \param[out] none
    \retval     none
*/
void timer_auto_reload_shadow_disable(uint32_t timer_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_TIMER_PERIPH(timer_periph)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0007U), ERR_PERIPH);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        TIMER_CTL0(timer_periph) &= (~(uint32_t)TIMER_CTL0_ARSE);
    }
}

/*!
    \brief      enable the update event
    \param[in]  timer_periph: TIMERx(x=0~7,14~16,22,23,40~44,50,51)
    \param[out] none
    \retval     none
*/
void timer_update_event_enable(uint32_t timer_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_TIMER_PERIPH(timer_periph)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0008U), ERR_PERIPH);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        TIMER_CTL0(timer_periph) &= (~(uint32_t)TIMER_CTL0_UPDIS);
    }
}

/*!
    \brief      disable the update event
    \param[in]  timer_periph: TIMERx(x=0~7,14~16,22,23,40~44,50,51)
    \param[out] none
    \retval     none
*/
void timer_update_event_disable(uint32_t timer_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_TIMER_PERIPH(timer_periph)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0009U), ERR_PERIPH);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        TIMER_CTL0(timer_periph) |= (uint32_t) TIMER_CTL0_UPDIS;
    }
}

/*!
    \brief      set TIMER counter alignment mode
    \param[in]  timer_periph: TIMERx(x=0~4,7,22,23)
    \param[in]  aligned: center-aligned mode
                only one parameter can be selected which is shown as below:
      \arg        TIMER_COUNTER_EDGE: edge-aligned mode
      \arg        TIMER_COUNTER_CENTER_DOWN: center-aligned and counting down assert mode
      \arg        TIMER_COUNTER_CENTER_UP: center-aligned and counting up assert mode
      \arg        TIMER_COUNTER_CENTER_BOTH: center-aligned and counting up/down assert mode
    \param[out] none
    \retval     none
*/
void timer_counter_alignment(uint32_t timer_periph, uint16_t aligned)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_TIMER_PERIPH(timer_periph)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x000AU), ERR_PERIPH);
    } else if(NOT_TIMER_ALIGNED(aligned)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x000AU), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        TIMER_CTL0(timer_periph) &= (uint32_t)(~TIMER_CTL0_CAM);
        TIMER_CTL0(timer_periph) |= (uint32_t)aligned;
    }
}

/*!
    \brief      set TIMER counter up direction
    \param[in]  timer_periph: TIMERx(x=0~4,7,22,23)
    \param[out] none
    \retval     none
*/
void timer_counter_up_direction(uint32_t timer_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_TIMER_PERIPH(timer_periph)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x000BU), ERR_PERIPH);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        TIMER_CTL0(timer_periph) &= (~(uint32_t)TIMER_CTL0_DIR);
    }
}

/*!
    \brief      set TIMER counter down direction
    \param[in]  timer_periph: TIMERx(x=0~4,7,22,23)
    \param[out] none
    \retval     none
*/
void timer_counter_down_direction(uint32_t timer_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_TIMER_PERIPH(timer_periph)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x000CU), ERR_PERIPH);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        TIMER_CTL0(timer_periph) |= (uint32_t)TIMER_CTL0_DIR;
    }
}

/*!
    \brief      configure TIMER prescaler
    \param[in]  timer_periph: TIMERx(x=0~7,14~16,22,23,40~44,50,51)
    \param[in]  prescaler: prescaler value, 0~0xFFFF
    \param[in]  pscreload: prescaler reload mode
                only one parameter can be selected which is shown as below:
      \arg        TIMER_PSC_RELOAD_NOW: the prescaler is loaded right now
      \arg        TIMER_PSC_RELOAD_UPDATE: the prescaler is loaded at the next update event
    \param[out] none
    \retval     none
*/
void timer_prescaler_config(uint32_t timer_periph, uint16_t prescaler, uint32_t pscreload)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_TIMER_PERIPH(timer_periph)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x000DU), ERR_PERIPH);
    } else if(NOT_TIMER_PSCRELOAD(pscreload)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x000DU), ERR_PARAM_OUT_OF_RANGE);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        TIMER_PSC(timer_periph) = (uint32_t)prescaler;
    
        if(TIMER_PSC_RELOAD_NOW == pscreload) {
            TIMER_SWEVG(timer_periph) |= (uint32_t)TIMER_SWEVG_UPG;
        }
    }
}

/*!
    \brief      configure TIMER repetition register value
    \param[in]  timer_periph: TIMERx(x=0,7,14~16,40~44)
    \param[in]  ccsel: repetition register selection
                only one parameter can be selected which is shown as below:
      \arg        TIMER_CREP0_ENABLE: The update event rate is depended to TIMERx_CREP0 register
      \arg        TIMER_CREP1_ENABLE: The update event rate is depended to TIMERx_CREP1 register
    \param[in]  repetition: the counter repetition value, 0~0xFF, use TIMER_CREP0 register,
                                                          0~0xFFFFFFFF, use TIMER_CREP1 register
    \param[out] none
    \retval     none
*/
void timer_repetition_value_config(uint32_t timer_periph, uint16_t ccsel, uint32_t repetition)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_TIMER_PERIPH(timer_periph)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x000EU), ERR_PERIPH);
    } else if(NOT_TIMER_CREP_CCSEL(ccsel)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x000EU), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if(TIMER_CREP0_ENABLE == ccsel) {
            TIMER_CFG(timer_periph) &= (~(uint32_t)TIMER_CFG_CREPSEL);
            TIMER_CREP0(timer_periph) = (uint32_t)repetition;
        } else if(TIMER_CREP1_ENABLE == ccsel) {
            TIMER_CFG(timer_periph) |= (uint32_t)TIMER_CFG_CREPSEL;
            TIMER_CREP1(timer_periph) = (uint32_t)repetition;
        } else {
            /* illegal parameters */
        }
    }
}

/*!
    \brief      read TIMER runtime repetition register value
    \param[in]  timer_periph: TIMERx(x=0,7,14~16,40~44)
    \param[out] none
    \retval     counter repetition value in TIMER_CREP1 register, 0~0xFFFFFFFF
*/
uint32_t timer_runtime_repetition_value_read(uint32_t timer_periph)
{
    uint32_t repetition_value = 0U;
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_TIMER_PERIPH(timer_periph)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x000FU), ERR_PERIPH);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        repetition_value = TIMER_CREP1(timer_periph);
    }
    return repetition_value;
}

/*!
    \brief      configure TIMER autoreload register value
    \param[in]  timer_periph: TIMERx(x=0~7,14~16,22,23,40~44,50,51)
    \param[in]  autoreload: the counter auto-reload value, 0~0xFFFF, TIMERx(x=0,2,3,7,14~16,40~44)
                                                           0~0xFFFFFFFF, TIMERx(x=1,4,5,6,22,23)
                                                           0~0xFFFFFFFFFFFFFFFF, TIMERx(x=50,51)
    \param[out] none
    \retval     none
*/
void timer_autoreload_value_config(uint32_t timer_periph, uint64_t autoreload)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_TIMER_PERIPH(timer_periph)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0010U), ERR_PERIPH);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* configure TIMER50/TIMER51 autoreload register value (64-bit) */
        if((TIMER50 == timer_periph) || (TIMER51 == timer_periph)) {
            TIMER_CARL(timer_periph) = (uint32_t)autoreload;
            TIMER_CARH(timer_periph) = (uint32_t)(autoreload >> 32U);
        } else {
            /* configure other TIMER autoreload register value (32-bit or 16-bit) */
            TIMER_CAR(timer_periph) = (uint32_t)autoreload;
        }
    }
}

/*!
    \brief      get TIMER autoreload register value
    \param[in]  timer_periph: TIMERx(x=0~7,14~16,22,23,40~44,50,51)
    \param[out] none
    \retval     counter auto reload register value, 0~0xFFFF, TIMERx(x=0,2,3,7,14~16,40~44)
                                                    0~0xFFFFFFFF, TIMERx(x=1,4,5,6,22,23)
                                                    0~0xFFFFFFFFFFFFFFFF, TIMERx(x=50,51)
*/
uint64_t timer_autoreload_value_read(uint32_t timer_periph)
{
    uint64_t autoreload = 0U;
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_TIMER_PERIPH(timer_periph)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0011U), ERR_PERIPH);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* read TIMER50/TIMER51 autoreload register value (64-bit) */
        if((TIMER50 == timer_periph) || (TIMER51 == timer_periph)) {
            autoreload = (((uint64_t)TIMER_CARH(timer_periph)) << 32U);
            autoreload |= TIMER_CARL(timer_periph);
        } else {
            /* read other TIMER autoreload register value (32-bit or 16-bit) */
            autoreload =  TIMER_CAR(timer_periph);
        }
    }
    return autoreload;
}

/*!
    \brief      configure TIMER counter register value
    \param[in]  timer_periph: TIMERx(x=0~7,14~16,22,23,40~44,50,51)
    \param[in]  counter: the counter value, 0~0xFFFF, TIMERx(x=0,2,3,7,14~16,40~44)
                                            0~0xFFFFFFFF, TIMERx(x=1,4,5,6,22,23)
                                            0~0xFFFFFFFFFFFFFFFF, TIMERx(x=50,51)
    \param[out] none
    \retval     none
*/
void timer_counter_value_config(uint32_t timer_periph, uint64_t counter)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_TIMER_PERIPH(timer_periph)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0012U), ERR_PERIPH);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* configure TIMER50/TIMER51 counter value (64-bit) */
        if((TIMER50 == timer_periph) || (TIMER51 == timer_periph)) {
            TIMER_CNTL(timer_periph) = (uint32_t)counter;
            TIMER_CNTH(timer_periph) = (uint32_t)(counter >> 32U);
            if(TIMER_CTL0(timer_periph) & TIMER_CTL0_UPIFBUEN) {
                TIMER_CNTH(timer_periph) &= (~TIMER_CNT_UPIFBU_MASK);
            }
        } else {
            /* configure other TIMER counter value (32-bit or 16-bit) */
            if(TIMER_CTL0(timer_periph) & TIMER_CTL0_UPIFBUEN) {
                counter &= (~TIMER_CNT_UPIFBU_MASK);
            }
            TIMER_CNT(timer_periph) = (uint32_t)counter;
        }
    }
}

/*!
    \brief      read TIMER counter value
    \param[in]  timer_periph: TIMERx(x=0~7,14~16,22,23,40~44,50,51)
    \param[out] none
    \retval     counter value: 0~0xFFFF, TIMERx(x=0,2,3,7,14~16,40~44)
                               0~0xFFFFFFFF, TIMERx(x=1,4,5,6,22,23)
                               0~0xFFFFFFFFFFFFFFFF, TIMERx(x=50,51)
*/
uint64_t timer_counter_read(uint32_t timer_periph)
{
    uint64_t count_value = 0U;
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_TIMER_PERIPH(timer_periph)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0013U), ERR_PERIPH);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* read TIMER50/TIMER51 counter value (64-bit) */
        if((TIMER50 == timer_periph) || (TIMER51 == timer_periph)) {
            count_value = (uint64_t)TIMER_CNTH(timer_periph);
            if((TIMER_CTL0(timer_periph) & TIMER_CTL0_UPIFBUEN)) {
                count_value &= (uint64_t)(~TIMER_CNT_UPIFBU_MASK);
            }
            count_value <<= 32U;
            count_value |= (uint64_t)TIMER_CNTL(timer_periph);
        } else {
            /* read other TIMER counter value (32-bit or 16-bit) */
            count_value = (uint64_t)TIMER_CNT(timer_periph);
            if((TIMER_CTL0(timer_periph) & TIMER_CTL0_UPIFBUEN)) {
                count_value &= (uint64_t)(~TIMER_CNT_UPIFBU_MASK);
            }
        }
    }
    return (count_value);
}

/*!
    \brief      read TIMER prescaler value
    \param[in]  timer_periph: TIMERx(x=0~7,14~16,22,23,40~44,50,51)
    \param[out] none
    \retval     prescaler register value, 0~0xFFFF
*/
uint16_t timer_prescaler_read(uint32_t timer_periph)
{
    uint16_t prescaler_value = 0U;
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_TIMER_PERIPH(timer_periph)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0014U), ERR_PERIPH);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        prescaler_value = (uint16_t)(TIMER_PSC(timer_periph));
    }
    return (prescaler_value);
}

/*!
    \brief      configure TIMER single pulse mode
    \param[in]  timer_periph: TIMERx(x=0~7,14~16,22,23,40~44,50,51)
    \param[in]  spmode: single pulse mode
                only one parameter can be selected which is shown as below:
      \arg        TIMER_SP_MODE_SINGLE: single pulse mode
      \arg        TIMER_SP_MODE_REPETITIVE: repetitive pulse mode
    \param[out] none
    \retval     none
*/
void timer_single_pulse_mode_config(uint32_t timer_periph, uint32_t spmode)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_TIMER_PERIPH(timer_periph)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0015U), ERR_PERIPH);
    } else if(NOT_TIMER_SPMODE(spmode)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0015U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if(TIMER_SP_MODE_SINGLE == spmode) {
            TIMER_CTL0(timer_periph) |= (uint32_t)TIMER_CTL0_SPM;
        } else if(TIMER_SP_MODE_REPETITIVE == spmode) {
            TIMER_CTL0(timer_periph) &= (~((uint32_t)TIMER_CTL0_SPM));
        } else {
            /* illegal parameters */
        }
    }
}

/*!
    \brief      configure timer delayable single pulse mode
    \param[in]  timer_periph: TIMERx(x=0~4,7,14,22,23,40~44)
    \param[in]  channel: TIMER channel
                only one parameter can be selected which is shown as below:
      \arg        TIMER_CH_0: TIMER channel 0(TIMERx(x=0~4,7,14,22,23,40~44))
      \arg        TIMER_CH_1: TIMER channel 1(TIMERx(x=0~4,7,14,22,23,40~44))
      \arg        TIMER_CH_2: TIMER channel 2(TIMERx(x=0~4,7,22,23))
      \arg        TIMER_CH_3: TIMER channel 3(TIMERx(x=0~4,7,22,23))
      \arg        TIMER_MCH_0: TIMER multi mode channel 0(TIMERx(x=0,7,14,40~44))
      \arg        TIMER_MCH_1: TIMER multi mode channel 1(TIMERx(x=0,7))
      \arg        TIMER_MCH_2: TIMER multi mode channel 2(TIMERx(x=0,7))
      \arg        TIMER_MCH_3: TIMER multi mode channel 3(TIMERx(x=0,7))
    \param[in]  dspmode: delayable SPM mode
                only one parameter can be selected which is shown as below:
      \arg        TIMER_OC_MODE_DSPM0: delayable SPM mode 0
      \arg        TIMER_OC_MODE_DSPM1: delayable SPM mode 1
    \param[in]  cnt_dir: counter direction selection
                only one parameter can be selected which is shown as below:
                  TIMER_COUNTER_UP: count up
                  TIMER_COUNTER_DOWN: count down
    \param[out] none
    \retval     none
*/
void timer_delayable_single_pulse_mode_config(uint32_t timer_periph, uint16_t channel, uint32_t dspmode, uint16_t cnt_dir)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_TIMER_PERIPH(timer_periph)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0016U), ERR_PERIPH);
    } else if(NOT_TIMER_ALL_CHANNEL(channel)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0016U), ERR_PARAM_INVALID);
    } else if(NOT_TIMER_DSPMODE(dspmode)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0016U), ERR_PARAM_INVALID);
    }else if(NOT_TIMER_CNT_DIR(cnt_dir)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0016U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* timer run in single mode*/
        timer_single_pulse_mode_config(timer_periph, TIMER_SP_MODE_SINGLE);
        /* set the CHxCOMCTL/MCHxCOMCTL bits */
        timer_channel_output_mode_config(timer_periph, channel, dspmode);
        /* set the restart + event slave mode */
        timer_slave_mode_select(timer_periph, TIMER_SLAVE_MODE_RESTART_EVENT);
        /* set the counter direction in edge-aligned mode*/
        TIMER_CTL0(timer_periph) &= (~(uint32_t)(TIMER_CTL0_DIR | TIMER_CTL0_CAM));
        TIMER_CTL0(timer_periph) |= (uint32_t)(cnt_dir & COUNTERDIRECTION_MASK);
        /* set the CHxCV/MCHxCV */
        if(TIMER_COUNTER_UP == cnt_dir) {
            switch(channel) {
            /* configure TIMER_CH_0 */
            case TIMER_CH_0:
                TIMER_CH0CV(timer_periph) = 0U;
                break;
            /* configure TIMER_CH_1 */
            case TIMER_CH_1:
                TIMER_CH1CV(timer_periph) = 0U;
                break;
            /* configure TIMER_CH_2 */
            case TIMER_CH_2:
                TIMER_CH2CV(timer_periph) = 0U;
                break;
            /* configure TIMER_CH_3 */
            case TIMER_CH_3:
                TIMER_CH3CV(timer_periph) = 0U;
                break;
            /* configure TIMER_MCH_0 */
            case TIMER_MCH_0:
                TIMER_MCH0CV(timer_periph) = 0U;
                break;
            /* configure TIMER_MCH_1 */
            case TIMER_MCH_1:
                TIMER_MCH1CV(timer_periph) = 0U;
                break;
            /* configure TIMER_MCH_2 */
            case TIMER_MCH_2:
                TIMER_MCH2CV(timer_periph) = 0U;
                break;
            /* configure TIMER_MCH_3 */
            case TIMER_MCH_3:
                TIMER_MCH3CV(timer_periph) = 0U;
                break;
            default:
                break;
            }
        } else if(TIMER_COUNTER_DOWN == cnt_dir) {
            /* read the CAR value */
            uint64_t value = timer_autoreload_value_read(timer_periph);
            switch(channel) {
            /* configure TIMER_CH_0 */
            case TIMER_CH_0:
                TIMER_CH0CV(timer_periph) = (uint32_t)value;
                break;
            /* configure TIMER_CH_1 */
            case TIMER_CH_1:
                TIMER_CH1CV(timer_periph) = (uint32_t)value;
                break;
            /* configure TIMER_CH_2 */
            case TIMER_CH_2:
                TIMER_CH2CV(timer_periph) = (uint32_t)value;
                break;
            /* configure TIMER_CH_3 */
            case TIMER_CH_3:
                TIMER_CH3CV(timer_periph) = (uint32_t)value;
                break;
            /* configure TIMER_MCH_0 */
            case TIMER_MCH_0:
                TIMER_MCH0CV(timer_periph) = (uint32_t)value;
                break;
            /* configure TIMER_MCH_1 */
            case TIMER_MCH_1:
                TIMER_MCH1CV(timer_periph) = (uint32_t)value;
                break;
            /* configure TIMER_MCH_2 */
            case TIMER_MCH_2:
                TIMER_MCH2CV(timer_periph) = (uint32_t)value;
                break;
            /* configure TIMER_MCH_3 */
            case TIMER_MCH_3:
                TIMER_MCH3CV(timer_periph) = (uint32_t)value;
                break;
            default:
                break;
            }
        } else {
            /* illegal parameters */
        }
    }
}

