RT-Thread-Studio/sdk-csp-gd32h7/libraries/GD32H75E_standard_peripheral/Source/gd32h75e_timer.c
            /* reset the CH0P and MCH0P bits */
            TIMER_CHCTL2(timer_periph) &= (~(uint32_t)(TIMER_CHCTL2_CH0P | TIMER_CHCTL2_MCH0P));
            TIMER_CHCTL2(timer_periph) |= (uint32_t)(icpara->icpolarity);
    
            /* reset the CH0MS bit */
            TIMER_CHCTL0(timer_periph) &= (~(uint32_t)TIMER_CHCTL0_CH0MS);
            if(TIMER_IC_SELECTION_PAIR == icpara->icselection) {
                TIMER_CHCTL0(timer_periph) |= (uint32_t)icpara->icselection << 28U;
            } else {
                TIMER_CHCTL0(timer_periph) |= ((uint32_t)icpara->icselection);
            }
    
            /* reset the CH0CAPFLT bit */
            TIMER_CHCTL0(timer_periph) &= (~(uint32_t)TIMER_CHCTL0_CH0CAPFLT);
            TIMER_CHCTL0(timer_periph) |= ((uint32_t)(icpara->icfilter) << 4U);
    
            /* set the CH0EN bit */
            TIMER_CHCTL2(timer_periph) |= (uint32_t)TIMER_CHCTL2_CH0EN;
            break;
    
        /* configure TIMER_CH_1 */
        case TIMER_CH_1:
            /* reset the CH1EN bit */
            TIMER_CHCTL2(timer_periph) &= (~(uint32_t)TIMER_CHCTL2_CH1EN);
    
            /* reset the CH1P and MCH1P bits */
            TIMER_CHCTL2(timer_periph) &= (~(uint32_t)(TIMER_CHCTL2_CH1P | TIMER_CHCTL2_MCH1P));
            TIMER_CHCTL2(timer_periph) |= ((uint32_t)(icpara->icpolarity) << 4U);
    
            /* reset the CH1MS bit */
            TIMER_CHCTL0(timer_periph) &= (~(uint32_t)TIMER_CHCTL0_CH1MS);
            if(TIMER_IC_SELECTION_PAIR == icpara->icselection) {
                TIMER_CHCTL0(timer_periph) |= ((uint32_t)icpara->icselection) << 29U;
            } else {
                TIMER_CHCTL0(timer_periph) |= (uint32_t)(icpara->icselection) << 8U;
            }
    
            /* reset the CH1CAPFLT bit */
            TIMER_CHCTL0(timer_periph) &= (~(uint32_t)TIMER_CHCTL0_CH1CAPFLT);
            TIMER_CHCTL0(timer_periph) |= ((uint32_t)(icpara->icfilter) << 12U);
    
            /* set the CH1EN bit */
            TIMER_CHCTL2(timer_periph) |= (uint32_t)TIMER_CHCTL2_CH1EN;
            break;
    
        /* configure TIMER_CH_2 */
        case TIMER_CH_2:
            /* reset the CH2EN bit */
            TIMER_CHCTL2(timer_periph) &= (~(uint32_t)TIMER_CHCTL2_CH2EN);
    
            /* reset the CH2P and MCH2P bits */
            TIMER_CHCTL2(timer_periph) &= (~(uint32_t)(TIMER_CHCTL2_CH2P | TIMER_CHCTL2_MCH2P));
            TIMER_CHCTL2(timer_periph) |= ((uint32_t)(icpara->icpolarity) << 8U);
    
            /* reset the CH2MS bit */
            TIMER_CHCTL1(timer_periph) &= (~(uint32_t)TIMER_CHCTL1_CH2MS);
            if(TIMER_IC_SELECTION_PAIR == icpara->icselection) {
                TIMER_CHCTL1(timer_periph) |= ((uint32_t)icpara->icselection << 28U);
            } else {
                TIMER_CHCTL1(timer_periph) |= ((uint32_t)(icpara->icselection));
            }
    
            /* reset the CH2CAPFLT bit */
            TIMER_CHCTL1(timer_periph) &= (~(uint32_t)TIMER_CHCTL1_CH2CAPFLT);
            TIMER_CHCTL1(timer_periph) |= ((uint32_t)(icpara->icfilter) << 4U);
    
            /* set the CH2EN bit */
            TIMER_CHCTL2(timer_periph) |= (uint32_t)TIMER_CHCTL2_CH2EN;
            break;
    
        /* configure TIMER_CH_3 */
        case TIMER_CH_3:
            /* reset the CH3EN bit */
            TIMER_CHCTL2(timer_periph) &= (~(uint32_t)TIMER_CHCTL2_CH3EN);
    
            /* reset the CH3P bits */
            TIMER_CHCTL2(timer_periph) &= (~(uint32_t)(TIMER_CHCTL2_CH3P | TIMER_CHCTL2_MCH3P));
            TIMER_CHCTL2(timer_periph) |= ((uint32_t)(icpara->icpolarity) << 12U);
    
            /* reset the CH3MS bit */
            TIMER_CHCTL1(timer_periph) &= (~(uint32_t)TIMER_CHCTL1_CH3MS);
            if(TIMER_IC_SELECTION_PAIR == icpara->icselection) {
                TIMER_CHCTL1(timer_periph) |= ((uint32_t)icpara->icselection << 29U);
            } else {
                TIMER_CHCTL1(timer_periph) |= ((uint32_t)(icpara->icselection) << 8U);
            }
    
            /* reset the CH3CAPFLT bit */
            TIMER_CHCTL1(timer_periph) &= (~(uint32_t)TIMER_CHCTL1_CH3CAPFLT);
            TIMER_CHCTL1(timer_periph) |= ((uint32_t)(icpara->icfilter) << 12U);
    
            /* set the CH3EN bit */
            TIMER_CHCTL2(timer_periph) |= (uint32_t)TIMER_CHCTL2_CH3EN;
            break;
    
        /* configure TIMER_MCH_0 */
        case TIMER_MCH_0:
            /* reset the MCH0EN bit */
            TIMER_CHCTL2(timer_periph) &= (~(uint32_t)TIMER_CHCTL2_MCH0EN);
    
            /* reset the MCH0FP bits */
            TIMER_MCHCTL2(timer_periph) &= (~(uint32_t)(TIMER_MCHCTL2_MCH0FP));
            switch(icpara->icpolarity) {
            case TIMER_IC_POLARITY_RISING:
                TIMER_MCHCTL2(timer_periph) |= TIMER_IMC_POLARITY_RISING;
                break;
            case TIMER_IC_POLARITY_FALLING:
                TIMER_MCHCTL2(timer_periph) |= TIMER_IMC_POLARITY_FALLING;
                break;
            case TIMER_IC_POLARITY_BOTH_EDGE:
                TIMER_MCHCTL2(timer_periph) |= TIMER_IMC_POLARITY_BOTH_EDGE;
                break;
            default:
                break;
            }
    
            /* reset the MCH0MS bit */
            TIMER_MCHCTL0(timer_periph) &= (~(uint32_t)TIMER_MCHCTL0_MCH0MS);
            if(TIMER_IC_SELECTION_PAIR == icpara->icselection) {
                TIMER_MCHCTL0(timer_periph) |= ((uint32_t)icpara->icselection << 28U);
            } else {
                TIMER_MCHCTL0(timer_periph) |= (uint32_t)(icpara->icselection);
            }
    
            /* reset the MCH0CAPFLT bit */
            TIMER_MCHCTL0(timer_periph) &= (~(uint32_t)TIMER_MCHCTL0_MCH0CAPFLT);
            TIMER_MCHCTL0(timer_periph) |= ((uint32_t)(icpara->icfilter) << 4U);
    
            /* set the MCH0EN bit */
            TIMER_CHCTL2(timer_periph) |= (uint32_t)TIMER_CHCTL2_MCH0EN;
            break;
    
        /* configure TIMER_MCH_1 */
        case TIMER_MCH_1:
            /* reset the MCH1EN bit */
            TIMER_CHCTL2(timer_periph) &= (~(uint32_t)TIMER_CHCTL2_MCH1EN);
    
