RT-Thread-Studio/sdk-csp-gd32h7/libraries/GD32H75E_standard_peripheral/Source/gd32h75e_timer.c
        /* read SYSCFG_TIMERCFG0 register value */
        TIMERxCFG0_value = SYSCFG_TIMERCFG0(TIMERx_temp) & 0x7FFF7FFFU;
        /* read SYSCFG_TIMERCFG1 register value */
        TIMERxCFG1_value = SYSCFG_TIMERCFG1(TIMERx_temp) & 0x001F7FFFU;
        /* read SYSCFG_TIMERCFG2 register value */
        TIMERxCFG2_value = SYSCFG_TIMERCFG2(TIMERx_temp) & 0x001F0000U;
        
        if((0U == TIMERxCFG0_value)&&(0U == TIMERxCFG1_value)&&(0U == TIMERxCFG2_value)){
            if(slavemode <= 2U){
                TIMERxCFG_temp = (uint32_t)0x1F << (slavemode * 5U);
            }else if((slavemode <= 5U)&&(slavemode >= 3U)){
                TIMERxCFG_temp = (uint32_t)0x1F << ((slavemode * 5U) + 1U);
            }else if((slavemode <= 8U)&&(slavemode >= 6U)){
                TIMERxCFG_temp = (uint32_t)0x1F << ((slavemode-6U) * 5U);
            }else if(slavemode == 9U){
                TIMERxCFG_temp = (uint32_t)0x1F << (((slavemode-6U) * 5U) + 1U);
            }else{
                TIMERxCFG_temp = (uint32_t)0x1F << (((slavemode-12U) * 5U) + 1U);
            }
        }else{
            if((SYSCFG_TIMERCFG0(TIMERx_temp) & 0x7FFF7FFFU) != 0U){
                for(i = 0U; i < 3U; i++){
                    if((SYSCFG_TIMERCFG0(TIMERx_temp) & (BITS(0,4) << (i * 5U))) != 0U){
                        trigger_temp = (SYSCFG_TIMERCFG0(TIMERx_temp) & (BITS(0,4) << (i * 5U))) >> (i * 5U);
                        SYSCFG_TIMERCFG0(TIMERx_temp)=0U;
                        break;
                    }
                }
                for(i = 3U; i < 6U; i++){
                    if((SYSCFG_TIMERCFG0(TIMERx_temp) & (BITS(0,4) << ((i * 5U)+1U))) != 0U){
                        trigger_temp = (SYSCFG_TIMERCFG0(TIMERx_temp) & (BITS(0,4) << ((i * 5U)+1U))) >> ((i * 5U)+1U);
                        SYSCFG_TIMERCFG0(TIMERx_temp)=0U;
                        break;
                    }
                }
            }else if((SYSCFG_TIMERCFG1(TIMERx_temp) & 0x001F7FFFU) != 0U){
                for(i = 6U; i < 10U; i++){
                    if(i < 9U){
                        if((SYSCFG_TIMERCFG1(TIMERx_temp) & (BITS(0,4) << ((i-6U)*5U))) != 0U){
                            trigger_temp = (SYSCFG_TIMERCFG1(TIMERx_temp) & (BITS(0,4) << ((i-6U) * 5U))) >> ((i-6U) * 5U);
                            SYSCFG_TIMERCFG1(TIMERx_temp)=0U;
                            break;
                        }
                    }else{
                        if((SYSCFG_TIMERCFG1(TIMERx_temp) & (BITS(0,4) << ((i-6U)*5U+1U))) != 0U){ 
                            trigger_temp = (SYSCFG_TIMERCFG1(TIMERx_temp) & (BITS(0,4) << ((i-6U)*5U+1U))) >> ((i-6U)*5U+1U);
                            SYSCFG_TIMERCFG1(TIMERx_temp)=0U;
                        }
                    }
                }
            }else{
                trigger_temp = (SYSCFG_TIMERCFG2(TIMERx_temp) & (BITS(0,4) << 16U)) >> 16U;
                SYSCFG_TIMERCFG2(TIMERx_temp)=0U;
            }
            
            if(slavemode <= 2U){
                TIMERxCFG_temp = trigger_temp << (slavemode * 5U);
            }else if((slavemode <= 5U)&&(slavemode >= 3U)){
                TIMERxCFG_temp = trigger_temp << ((slavemode * 5U) + 1U);
            }else if((slavemode <= 8U)&&(slavemode >= 6U)){
                TIMERxCFG_temp = trigger_temp << ((slavemode-6U) * 5U);
            }else if(slavemode == 9U){
                TIMERxCFG_temp = trigger_temp << (((slavemode-6U) * 5U) + 1U);
            }else{
                TIMERxCFG_temp = trigger_temp << (((slavemode-12U) * 5U) + 1U);
            }
        }
        REG32(TIMERxCFG_addr) = TIMERxCFG_temp;
    }
}

/*!
    \brief      configure TIMER master slave mode
    \param[in]  TIMERx(x=0~4,7,14,22,23,40~44)
    \param[in]  masterslave: master slave mode
                only one parameter can be selected which is shown as below:
      \arg        TIMER_MASTER_SLAVE_MODE_ENABLE: master slave mode enable
      \arg        TIMER_MASTER_SLAVE_MODE_DISABLE: master slave mode disable
    \param[out] none
    \retval     none
*/
void timer_master_slave_mode_config(uint32_t timer_periph, uint32_t masterslave)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_TIMER_PERIPH(timer_periph)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x003DU), ERR_PERIPH);
    } else if(NOT_TIMER_MASTER_SLAVE_MODE(masterslave)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x003DU), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if(TIMER_MASTER_SLAVE_MODE_ENABLE == masterslave) {
            TIMER_SMCFG(timer_periph) |= (uint32_t)TIMER_SMCFG_MSM;
        } else if(TIMER_MASTER_SLAVE_MODE_DISABLE == masterslave) {
            TIMER_SMCFG(timer_periph) &= (~(uint32_t)TIMER_SMCFG_MSM);
        } else {
            /* illegal parameters */
        }
    }
}

/*!
    \brief      configure TIMER external trigger input
    \param[in]  timer_periph: TIMERx(x=0~4,7,22,23)
    \param[in]  extprescaler: external trigger prescaler
                only one parameter can be selected which is shown as below:
      \arg        TIMER_EXT_TRI_PSC_OFF: no divided
      \arg        TIMER_EXT_TRI_PSC_DIV2: divided by 2
      \arg        TIMER_EXT_TRI_PSC_DIV4: divided by 4
      \arg        TIMER_EXT_TRI_PSC_DIV8: divided by 8
    \param[in]  extpolarity: external trigger polarity
                only one parameter can be selected which is shown as below:
      \arg        TIMER_ETP_FALLING: active low or falling edge active
      \arg        TIMER_ETP_RISING: active high or rising edge active
    \param[in]  extfilter: a value between 0 and 15
    \param[out] none
    \retval     none
*/
void timer_external_trigger_config(uint32_t timer_periph, uint32_t extprescaler, uint32_t extpolarity, uint32_t extfilter)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_TIMER_PERIPH(timer_periph)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x003EU), ERR_PERIPH);
    } else if(NOT_TIMER_EXT_TRI_PSC(extprescaler)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x003EU), ERR_PARAM_INVALID);
    } else if(NOT_TIMER_EXTPOLARITY(extpolarity)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x003EU), ERR_PARAM_INVALID);
    } else if(NOT_TIMER_CHANNEL_EXTFILTER(extfilter)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x003EU), ERR_PARAM_INVALID);
    }  else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        TIMER_SMCFG(timer_periph) &= (~(uint32_t)(TIMER_SMCFG_ETP | TIMER_SMCFG_ETPSC | TIMER_SMCFG_ETFC));
        TIMER_SMCFG(timer_periph) |= (uint32_t)(extprescaler | extpolarity);
        TIMER_SMCFG(timer_periph) |= (uint32_t)(extfilter << 8U);
    }
}

/*!
    \brief      configure TIMER quadrature decoder mode
    \param[in]  timer_periph: TIMERx(x=0~4,7,22,23)
    \param[in]  decomode: quadrature decoder mode
                only one parameter can be selected which is shown as below:
      \arg        TIMER_QUAD_DECODER_MODE0: counter counts on CI0FE0 edge depending on CI1FE1 level
      \arg        TIMER_QUAD_DECODER_MODE1: counter counts on CI1FE1 edge depending on CI0FE0 level
      \arg        TIMER_QUAD_DECODER_MODE2: counter counts on both CI0FE0 and CI1FE1 edges depending on the level of the other input
    \param[in]  ic0polarity: input capture polarity
                only one parameter can be selected which is shown as below:
      \arg        TIMER_IC_POLARITY_RISING: capture rising edge
      \arg        TIMER_IC_POLARITY_FALLING: capture falling edge
      \arg        TIMER_IC_POLARITY_BOTH_EDGE: active both edge
    \param[in]  ic1polarity: input capture polarity
                only one parameter can be selected which is shown as below:
      \arg        TIMER_IC_POLARITY_RISING: capture rising edge
      \arg        TIMER_IC_POLARITY_FALLING: capture falling edge
      \arg        TIMER_IC_POLARITY_BOTH_EDGE: active both edge
    \param[out] none
    \retval     none
*/
void timer_quadrature_decoder_mode_config(uint32_t timer_periph, uint32_t decomode, uint16_t ic0polarity, uint16_t ic1polarity)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_TIMER_PERIPH(timer_periph)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x003FU), ERR_PERIPH);
    } else if(NOT_TIMER_QUAD_DECODER(decomode)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x003FU), ERR_PARAM_INVALID);
    } else if(NOT_TIMER_ICPOLARITY(ic0polarity)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x003FU), ERR_PARAM_INVALID);
    } else if(NOT_TIMER_ICPOLARITY(ic1polarity)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x003FU), ERR_PARAM_INVALID);
    }  else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* configure the quadrature decoder mode */
        timer_slave_mode_select(timer_periph, decomode);
    
        /* configure input capture selection */
        TIMER_CHCTL0(timer_periph) &= (uint32_t)(((~(uint32_t)TIMER_CHCTL0_CH0MS)) & ((~(uint32_t)TIMER_CHCTL0_CH1MS)));
        TIMER_CHCTL0(timer_periph) |= (uint32_t)(TIMER_IC_SELECTION_DIRECTTI | ((uint32_t)TIMER_IC_SELECTION_DIRECTTI << 8U));
        /* configure channel input capture polarity */
        TIMER_CHCTL2(timer_periph) &= (~(uint32_t)(TIMER_CHCTL2_CH0P | TIMER_CHCTL2_MCH0P));
        TIMER_CHCTL2(timer_periph) &= (~(uint32_t)(TIMER_CHCTL2_CH1P | TIMER_CHCTL2_MCH1P));
        TIMER_CHCTL2(timer_periph) |= ((uint32_t)ic0polarity | ((uint32_t)ic1polarity << 4U));
    }
}

/*!
    \brief      configure TIMER non-quadrature decoder mode
    \param[in]  timer_periph: TIMERx(x=0~4,7,22,23)
    \param[in]  decomode: non-quadrature decoder mode
                only one parameter can be selected which is shown as below:
      \arg        TIMER_NONQUAD_DECODER_MODE0: non-quadrature decoder mode 0
      \arg        TIMER_NONQUAD_DECODER_MODE1: non-quadrature decoder mode 1
    \param[in]  ic1polarity: input capture polarity
                only one parameter can be selected which is shown as below:
      \arg        TIMER_IC_POLARITY_RISING: capture rising edge
      \arg        TIMER_IC_POLARITY_FALLING: capture falling edge
    \param[out] none
    \retval     none
*/
void timer_non_quadrature_decoder_mode_config(uint32_t timer_periph, uint32_t decomode, uint16_t ic1polarity)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_TIMER_PERIPH(timer_periph)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0040U), ERR_PERIPH);
    } else if(NOT_TIMER_NONQUAD_DECODER(decomode)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0040U), ERR_PARAM_INVALID);
    } else if(NOT_TIMER_ICPOLARITY(ic1polarity)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0040U), ERR_PARAM_INVALID);
    }  else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* configure the quadrature decoder mode */
        timer_slave_mode_select(timer_periph, decomode);
    
        /* configure input capture selection */
        TIMER_CHCTL0(timer_periph) &= (uint32_t)(((~(uint32_t)TIMER_CHCTL0_CH0MS)) & ((~(uint32_t)TIMER_CHCTL0_CH1MS)));
        TIMER_CHCTL0(timer_periph) |= (uint32_t)(TIMER_IC_SELECTION_DIRECTTI | ((uint32_t)TIMER_IC_SELECTION_DIRECTTI << 8U));
        /* configure channel input capture polarity */
        TIMER_CHCTL2(timer_periph) &= (~(uint32_t)TIMER_CHCTL2_CH1P);
        TIMER_CHCTL2(timer_periph) |= ((uint32_t)ic1polarity << 4U);
    }
}

/*!
    \brief      configure TIMER internal clock mode
    \param[in]  timer_periph: TIMERx(x=0~4,7,14,22,23,40~44)
    \param[out] none
    \retval     none
*/
void timer_internal_clock_config(uint32_t timer_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_TIMER_PERIPH(timer_periph)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0041U), ERR_PERIPH);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        timer_slave_mode_select(timer_periph, TIMER_SLAVE_MODE_DISABLE);
    }
}

/*!
    \brief      configure TIMER the internal trigger as external clock input
    \param[in]  timer_periph: TIMERx(x=0~4,7,14,22,23,40~44)
    \param[in]  intrigger: internal trigger selection
                only one parameter can be selected which is shown as below:
      \arg        TIMER_SMCFG_TRGSEL_ITI0: internal trigger 0(TIMERx(x=0~4,7,14,22,23,40~44))
      \arg        TIMER_SMCFG_TRGSEL_ITI1: internal trigger 1(TIMERx(x=0~4,7,14,22,23,40~44))
      \arg        TIMER_SMCFG_TRGSEL_ITI2: internal trigger 2(TIMERx(x=0~4,7,14,22,23,40~44))
      \arg        TIMER_SMCFG_TRGSEL_ITI3: internal trigger 3(TIMERx(x=0~4,7,14,22,23,40~44))
      \arg        TIMER_L0_SMCFG_TRGSEL_ITI4: internal trigger 4 for General-L0 timer(TIMERx(x=1,2,22,23))
      \arg        TIMER_L0_SMCFG_TRGSEL_ITI5: internal trigger 5 for General-L0 timer(TIMERx(x=1,22,23))
      \arg        TIMER_L0_SMCFG_TRGSEL_ITI7: internal trigger 7 for General-L0 timer(TIMERx(x=4))
      \arg        TIMER_L0_SMCFG_TRGSEL_ITI9: internal trigger 9 for General-L0 timer(TIMERx(x=22,23))
      \arg        TIMER_L0_SMCFG_TRGSEL_ITI10: internal trigger 10 for General-L0 timer(TIMERx(x=22,23))
      \arg        TIMER_L0_SMCFG_TRGSEL_ITI11: internal trigger 11 for General-L0 timer(TIMERx(x=22,23))
      \arg        TIMER_SMCFG_TRGSEL_ITI12: internal trigger 12(TIMERx(x=0~4,7,23))
      \arg        TIMER_SMCFG_TRGSEL_ITI13: internal trigger 13(TIMERx(x=0~4,7,22))
      \arg        TIMER_SMCFG_TRGSEL_ITI14: internal trigger 14(TIMERx(x=0~4,7,14,22,23,40~44))
    \param[out] none
    \retval     none
*/
void timer_internal_trigger_as_external_clock_config(uint32_t timer_periph, uint32_t intrigger)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_TIMER_PERIPH(timer_periph)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0042U), ERR_PERIPH);
    } else if(NOT_TIMER_INTRIGGER(intrigger)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0042U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* select TIMER slave mode */
        timer_slave_mode_select(timer_periph, TIMER_SLAVE_MODE_EXTERNAL0);
        /* select TIMER input trigger source */
        timer_input_trigger_source_select(timer_periph, intrigger);
    }
}

