RT-Thread-Studio/sdk-csp-gd32h7/libraries/GD32H75E_standard_peripheral/Source/gd32h75e_timer.c
/*!
    \brief      configure TIMER the external trigger as external clock input
    \param[in]  timer_periph: TIMERx(x=0~4,7,14,22,23,40~44)
    \param[in]  extrigger: external trigger selection
                only one parameter can be selected which is shown as below:
      \arg        TIMER_SMCFG_TRGSEL_CI0F_ED: TI0 edge detector(TIMERx(x=0~4,7,14,22,23,40~44))
      \arg        TIMER_SMCFG_TRGSEL_CI0FE0: filtered channel 0 input(TIMERx(x=0~4,7,14,22,23,40~44))
      \arg        TIMER_SMCFG_TRGSEL_CI1FE1: filtered channel 1 input(TIMERx(x=0~4,7,14,22,23,40~44))
      \arg        TIMER_SMCFG_TRGSEL_CI2FE2: filtered channel 2 input(TIMERx(x=0,7))
      \arg        TIMER_SMCFG_TRGSEL_CI3FE3: filtered channel 3 input(TIMERx(x=0,7))
      \arg        TIMER_SMCFG_TRGSEL_MCI0FEM0: filtered multi mode channel 0 input(TIMERx(x=0,7,14,40~44))
      \arg        TIMER_SMCFG_TRGSEL_MCI1FEM1: filtered multi mode channel 1 input(TIMERx(x=0,7))
      \arg        TIMER_SMCFG_TRGSEL_MCI2FEM2: filtered multi mode channel 2 input(TIMERx(x=0,7))
      \arg        TIMER_SMCFG_TRGSEL_MCI3FEM3: filtered multi mode channel 3 input(TIMERx(x=0,7))
    \param[in]  extpolarity: external input capture polarity
                only one parameter can be selected which is shown as below:
      \arg        TIMER_IC_POLARITY_RISING: active high or rising edge active
      \arg        TIMER_IC_POLARITY_FALLING: active low or falling edge active
      \arg        TIMER_IC_POLARITY_BOTH_EDGE: active both edge
    \param[in]  extfilter: a value between 0 and 15
    \param[out] none
    \retval     none
*/
void timer_external_trigger_as_external_clock_config(uint32_t timer_periph, uint32_t extrigger, uint16_t extpolarity, uint32_t extfilter)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_TIMER_PERIPH(timer_periph)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0043U), ERR_PERIPH);
    } else if(NOT_TIMER_EXTRIGGER(extrigger)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0043U), ERR_PARAM_INVALID);
    } else if(NOT_TIMER_ICPOLARITY(extpolarity)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0043U), ERR_PARAM_INVALID);
    } else if(NOT_TIMER_CHANNEL_EXTFILTER(extfilter)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0043U), ERR_PARAM_OUT_OF_RANGE);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if(TIMER_SMCFG_TRGSEL_CI1FE1 == extrigger) {
            /* reset the CH1EN bit */
            TIMER_CHCTL2(timer_periph) &= (~(uint32_t)TIMER_CHCTL2_CH1EN);
            /* reset the CH1P and MCH1P bits */
            TIMER_CHCTL2(timer_periph) &= (~(uint32_t)(TIMER_CHCTL2_CH1P | TIMER_CHCTL2_MCH1P));
            /* set the CH1P and MCH1P bits */
            TIMER_CHCTL2(timer_periph) |= (uint32_t)((uint32_t)extpolarity << 4U);
            /* reset the CH1MS bit */
            TIMER_CHCTL0(timer_periph) &= (~(uint32_t)TIMER_CHCTL0_CH1MS);
            /* set the CH1MS bit */
            TIMER_CHCTL0(timer_periph) |= (uint32_t)((uint32_t)TIMER_IC_SELECTION_DIRECTTI << 8U);
            /* reset the CH1CAPFLT bit */
            TIMER_CHCTL0(timer_periph) &= (~(uint32_t)TIMER_CHCTL0_CH1CAPFLT);
            /* set the CH1CAPFLT bit */
            TIMER_CHCTL0(timer_periph) |= (uint32_t)(extfilter << 12U);
            /* set the CH1EN bit */
            TIMER_CHCTL2(timer_periph) |= (uint32_t)TIMER_CHCTL2_CH1EN;
        } else if(TIMER_SMCFG_TRGSEL_CI2FE2 == extrigger) {
            /* reset the CH2EN bit */
            TIMER_CHCTL2(timer_periph) &= (~(uint32_t)TIMER_CHCTL2_CH2EN);
            /* reset the CH2P and MCH2P bits */
            TIMER_CHCTL2(timer_periph) &= (~(uint32_t)(TIMER_CHCTL2_CH2P | TIMER_CHCTL2_MCH2P));
            /* set the CH2P and MCH2P bits */
            TIMER_CHCTL2(timer_periph) |= ((uint32_t)extpolarity << 8U);
            /* reset the CH2MS bit */
            TIMER_CHCTL1(timer_periph) &= (~(uint32_t)TIMER_CHCTL1_CH2MS);
            /* set the CH2MS bit */
            TIMER_CHCTL1(timer_periph) |= ((uint32_t)TIMER_IC_SELECTION_DIRECTTI);
            /* reset the CH2CAPFLT bit */
            TIMER_CHCTL1(timer_periph) &= (~(uint32_t)TIMER_CHCTL1_CH2CAPFLT);
            /* set the CH2CAPFLT bit */
            TIMER_CHCTL1(timer_periph) |= (uint32_t)(extfilter << 4U);
            /* set the CH2EN bit */
            TIMER_CHCTL2(timer_periph) |= (uint32_t)TIMER_CHCTL2_CH2EN;
        } else if(TIMER_SMCFG_TRGSEL_CI3FE3 == extrigger) {
            /* reset the CH3EN bit */
            TIMER_CHCTL2(timer_periph) &= (~(uint32_t)TIMER_CHCTL2_CH3EN);
            /* reset the CH3P and MCH3P bits */
            TIMER_CHCTL2(timer_periph) &= (~(uint32_t)(TIMER_CHCTL2_CH3P | TIMER_CHCTL2_MCH3P));
            /* set the CH3P and MCH3P bits */
            TIMER_CHCTL2(timer_periph) |= ((uint32_t)extpolarity << 12U);
            /* reset the CH3MS bit */
            TIMER_CHCTL1(timer_periph) &= (~(uint32_t)TIMER_CHCTL1_CH3MS);
            /* set the CH3MS bit */
            TIMER_CHCTL1(timer_periph) |= ((uint32_t)TIMER_IC_SELECTION_DIRECTTI << 8U);
            /* reset the CH3CAPFLT bit */
            TIMER_CHCTL1(timer_periph) &= (~(uint32_t)TIMER_CHCTL1_CH3CAPFLT);
            /* set the CH3CAPFLT bit */
            TIMER_CHCTL1(timer_periph) |= (uint32_t)(extfilter << 12U);
            /* set the CH3EN bit */
            TIMER_CHCTL2(timer_periph) |= (uint32_t)TIMER_CHCTL2_CH3EN;
        } else if(TIMER_SMCFG_TRGSEL_MCI0FEM0 == extrigger) {
            /* reset the MCH0EN bit */
            TIMER_CHCTL2(timer_periph) &= (~(uint32_t)TIMER_CHCTL2_MCH0EN);
            /* reset the MCH0FP bit */
            TIMER_MCHCTL2(timer_periph) &= (~(uint32_t)TIMER_MCHCTL2_MCH0FP);
            /* set the MCH0FP bit */
            if(TIMER_IC_POLARITY_RISING == extpolarity) {
                TIMER_MCHCTL2(timer_periph) |= (uint32_t)TIMER_IMC_POLARITY_RISING;
            } else if(TIMER_IC_POLARITY_FALLING == extpolarity) {
                TIMER_MCHCTL2(timer_periph) |= (uint32_t)TIMER_IMC_POLARITY_FALLING;
            } else {
                TIMER_MCHCTL2(timer_periph) |= (uint32_t)TIMER_IMC_POLARITY_BOTH_EDGE;
            }
            /* reset the MCH0MS bit */
            TIMER_MCHCTL0(timer_periph) &= (~(uint32_t)TIMER_MCHCTL0_MCH0MS);
            /* set the MCH0MS bit */
            TIMER_MCHCTL0(timer_periph) |= (uint32_t)TIMER_IC_SELECTION_DIRECTTI;
            /* reset the MCH0CAPFLT bit */
            TIMER_MCHCTL0(timer_periph) &= (~(uint32_t)TIMER_MCHCTL0_MCH0CAPFLT);
            /* reset the MCH0CAPFLT bit */
            TIMER_MCHCTL0(timer_periph) |= (uint32_t)(extfilter << 4U);
            /* set the MCH0EN bit */
            TIMER_CHCTL2(timer_periph) |= (uint32_t)TIMER_CHCTL2_MCH0EN;
        } else if(TIMER_SMCFG_TRGSEL_MCI1FEM1 == extrigger) {
            /* reset the MCH1EN bit */
            TIMER_CHCTL2(timer_periph) &= (~(uint32_t)TIMER_CHCTL2_MCH1EN);
            /* reset the MCH1FP bit */
            TIMER_MCHCTL2(timer_periph) &= (~(uint32_t)TIMER_MCHCTL2_MCH1FP);
            /* set the MCH1FP bit */
            if(TIMER_IC_POLARITY_RISING == extpolarity) {
                TIMER_MCHCTL2(timer_periph) |= (uint32_t)TIMER_IMC_POLARITY_RISING << 2U;
            } else if(TIMER_IC_POLARITY_FALLING == extpolarity) {
                TIMER_MCHCTL2(timer_periph) |= (uint32_t)TIMER_IMC_POLARITY_FALLING << 2U;
            } else {
                TIMER_MCHCTL2(timer_periph) |= (uint32_t)TIMER_IMC_POLARITY_BOTH_EDGE << 2U;
            }
            /* reset the MCH1MS bit */
            TIMER_MCHCTL0(timer_periph) &= (~(uint32_t)TIMER_MCHCTL0_MCH1MS);
            /* set the MCH1MS bit */
            TIMER_MCHCTL0(timer_periph) |= ((uint32_t)TIMER_IC_SELECTION_DIRECTTI << 8U);
            /* reset the MCH1CAPFLT bit */
            TIMER_MCHCTL0(timer_periph) &= (~(uint32_t)TIMER_MCHCTL0_MCH1CAPFLT);
            /* set the MCH1CAPFLT bit */
            TIMER_MCHCTL0(timer_periph) |= (uint32_t)(extfilter << 12U);
            /* set the MCH1EN bit */
            TIMER_CHCTL2(timer_periph) |= (uint32_t)TIMER_CHCTL2_MCH1EN;
        } else if(TIMER_SMCFG_TRGSEL_MCI2FEM2 == extrigger) {
            /* reset the MCH2EN bit */
            TIMER_CHCTL2(timer_periph) &= (~(uint32_t)TIMER_CHCTL2_MCH2EN);
            /* reset the MCH2FP bit */
            TIMER_MCHCTL2(timer_periph) &= (~(uint32_t)TIMER_MCHCTL2_MCH2FP);
            /* set the MCH2FP bit */
            if(TIMER_IC_POLARITY_RISING == extpolarity) {
                TIMER_MCHCTL2(timer_periph) |= (uint32_t)TIMER_IMC_POLARITY_RISING << 4U;
            } else if(TIMER_IC_POLARITY_FALLING == extpolarity) {
                TIMER_MCHCTL2(timer_periph) |= (uint32_t)TIMER_IMC_POLARITY_FALLING << 4U;
            } else {
                TIMER_MCHCTL2(timer_periph) |= (uint32_t)TIMER_IMC_POLARITY_BOTH_EDGE << 4U;
            }
            /* reset the MCH2MS bit */
            TIMER_MCHCTL1(timer_periph) &= (~(uint32_t)TIMER_MCHCTL1_MCH2MS);
            /* set the MCH2MS bit */
            TIMER_MCHCTL1(timer_periph) |= ((uint32_t)TIMER_IC_SELECTION_DIRECTTI);
            /* reset the MCH2CAPFLT bit */
            TIMER_MCHCTL1(timer_periph) &= (~(uint32_t)TIMER_MCHCTL1_MCH2CAPFLT);
            /* set the MCH2CAPFLT bit */
            TIMER_MCHCTL1(timer_periph) |= (uint32_t)(extfilter << 4U);
            /* set the MCH2EN bit */
            TIMER_CHCTL2(timer_periph) |= (uint32_t)TIMER_CHCTL2_MCH2EN;
        } else if(TIMER_SMCFG_TRGSEL_MCI3FEM3 == extrigger) {
            /* reset the MCH3EN bit */
            TIMER_CHCTL2(timer_periph) &= (~(uint32_t)TIMER_CHCTL2_MCH3EN);
            /* reset the MCH3FP bit */
            TIMER_MCHCTL2(timer_periph) &= (~(uint32_t)TIMER_MCHCTL2_MCH3FP);
            /* set the MCH3FP bit */
            if(TIMER_IC_POLARITY_RISING == extpolarity) {
                TIMER_MCHCTL2(timer_periph) |= (uint32_t)TIMER_IMC_POLARITY_RISING << 6U;
            } else if(TIMER_IC_POLARITY_FALLING == extpolarity) {
                TIMER_MCHCTL2(timer_periph) |= (uint32_t)TIMER_IMC_POLARITY_FALLING << 6U;
            } else {
                TIMER_MCHCTL2(timer_periph) |= (uint32_t)TIMER_IMC_POLARITY_BOTH_EDGE << 6U;
            }
            /* reset the MCH3MS bit */
            TIMER_MCHCTL1(timer_periph) &= (~(uint32_t)TIMER_MCHCTL1_MCH3MS);
            /* set the MCH3MS bit */
            TIMER_MCHCTL1(timer_periph) |= ((uint32_t)TIMER_IC_SELECTION_DIRECTTI << 8U);
            /* reset the MCH3CAPFLT bit */
            TIMER_MCHCTL1(timer_periph) &= (~(uint32_t)TIMER_MCHCTL1_MCH3CAPFLT);
            /* set the MCH3CAPFLT bit */
            TIMER_MCHCTL1(timer_periph) |= (uint32_t)(extfilter << 12U);
            /* set the MCH3EN bit */
            TIMER_CHCTL2(timer_periph) |= (uint32_t)TIMER_CHCTL2_MCH3EN;
        } else {
            /* reset the CH0EN bit */
            TIMER_CHCTL2(timer_periph) &= (~(uint32_t)TIMER_CHCTL2_CH0EN);
            /* reset the CH0P and MCH0P bits */
            TIMER_CHCTL2(timer_periph) &= (~(uint32_t)(TIMER_CHCTL2_CH0P | TIMER_CHCTL2_MCH0P));
            /* set the CH0P and MCH0P bits */
            TIMER_CHCTL2(timer_periph) |= (uint32_t)extpolarity;
            /* reset the CH0MS bit */
            TIMER_CHCTL0(timer_periph) &= (~(uint32_t)TIMER_CHCTL0_CH0MS);
            /* set the CH0MS bit */
            TIMER_CHCTL0(timer_periph) |= (uint32_t)TIMER_IC_SELECTION_DIRECTTI;
            /* reset the CH0CAPFLT bit */
            TIMER_CHCTL0(timer_periph) &= (~(uint32_t)TIMER_CHCTL0_CH0CAPFLT);
            /* reset the CH0CAPFLT bit */
            TIMER_CHCTL0(timer_periph) |= (uint32_t)(extfilter << 4U);
            /* set the CH0EN bit */
            TIMER_CHCTL2(timer_periph) |= (uint32_t)TIMER_CHCTL2_CH0EN;
        }
    
        /* select TIMER slave mode */
        timer_slave_mode_select(timer_periph, TIMER_SLAVE_MODE_EXTERNAL0);
        /* select TIMER input trigger source */
        timer_input_trigger_source_select(timer_periph, extrigger);
    }
}

/*!
    \brief      configure TIMER the external clock mode0
    \param[in]  timer_periph: TIMERx(x=0~4,7,14,22,23,40~44)
    \param[in]  extprescaler: external trigger prescaler
                only one parameter can be selected which is shown as below:
      \arg        TIMER_EXT_TRI_PSC_OFF: no divided
      \arg        TIMER_EXT_TRI_PSC_DIV2: divided by 2
      \arg        TIMER_EXT_TRI_PSC_DIV4: divided by 4
      \arg        TIMER_EXT_TRI_PSC_DIV8: divided by 8
    \param[in]  extpolarity: external input capture polarity
                only one parameter can be selected which is shown as below:
      \arg        TIMER_ETP_FALLING: active low or falling edge active
      \arg        TIMER_ETP_RISING: active high or rising edge active
    \param[in]  extfilter: a value between 0 and 15
    \param[out] none
    \retval     none
*/
void timer_external_clock_mode0_config(uint32_t timer_periph, uint32_t extprescaler, uint32_t extpolarity, uint32_t extfilter)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_TIMER_PERIPH(timer_periph)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0044U), ERR_PERIPH);
    } else if(NOT_TIMER_EXT_TRI_PSC(extprescaler)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0044U), ERR_PARAM_INVALID);
    } else if(NOT_TIMER_EXTPOLARITY(extpolarity)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0044U), ERR_PARAM_INVALID);
    } else if(NOT_TIMER_CHANNEL_EXTFILTER(extfilter)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0044U), ERR_PARAM_OUT_OF_RANGE);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* configure TIMER external trigger input */
        timer_external_trigger_config(timer_periph, extprescaler, extpolarity, extfilter);
        /* select TIMER slave mode */
        timer_slave_mode_select(timer_periph, TIMER_SLAVE_MODE_EXTERNAL0);
        /* select TIMER input trigger source */
        timer_input_trigger_source_select(timer_periph, TIMER_SMCFG_TRGSEL_ETIFP);
    }
}

/*!
    \brief      configure TIMER the external clock mode1
    \param[in]  timer_periph: TIMERx(x=0~4,7,22,23)
    \param[in]  extprescaler: external trigger prescaler
                only one parameter can be selected which is shown as below:
      \arg        TIMER_EXT_TRI_PSC_OFF: no divided
      \arg        TIMER_EXT_TRI_PSC_DIV2: divided by 2
      \arg        TIMER_EXT_TRI_PSC_DIV4: divided by 4
      \arg        TIMER_EXT_TRI_PSC_DIV8: divided by 8
    \param[in]  extpolarity: external input capture polarity
                only one parameter can be selected which is shown as below:
      \arg        TIMER_ETP_FALLING: active low or falling edge active
      \arg        TIMER_ETP_RISING: active high or rising edge active
    \param[in]  extfilter: a value between 0 and 15
    \param[out] none
    \retval     none
*/
void timer_external_clock_mode1_config(uint32_t timer_periph, uint32_t extprescaler, uint32_t extpolarity, uint32_t extfilter)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_TIMER_PERIPH(timer_periph)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0045U), ERR_PERIPH);
    } else if(NOT_TIMER_EXT_TRI_PSC(extprescaler)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0045U), ERR_PARAM_INVALID);
    } else if(NOT_TIMER_EXTPOLARITY(extpolarity)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0045U), ERR_PARAM_INVALID);
    } else if(NOT_TIMER_CHANNEL_EXTFILTER(extfilter)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0045U), ERR_PARAM_OUT_OF_RANGE);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* configure TIMER external trigger input */
        timer_external_trigger_config(timer_periph, extprescaler, extpolarity, extfilter);
        TIMER_SMCFG(timer_periph) |= (uint32_t)TIMER_SMCFG_SMC1;
    }
}

/*!
    \brief      disable TIMER the external clock mode1
    \param[in]  timer_periph: TIMERx(x=0~4,7,22,23)
    \param[out] none
    \retval     none
*/
void timer_external_clock_mode1_disable(uint32_t timer_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_TIMER_PERIPH(timer_periph)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0046U), ERR_PERIPH);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        TIMER_SMCFG(timer_periph) &= (~(uint32_t)TIMER_SMCFG_SMC1);
    }
}

/*!
    \brief      configure TIMER write CHxVAL register selection
    \param[in]  timer_periph: TIMERx(x=0~4,14~16,22,23,40~44)
    \param[in]  ccsel: write CHxVAL register selection
                only one parameter can be selected which is shown as below:
      \arg        TIMER_CHVSEL_DISABLE: no effect
      \arg        TIMER_CHVSEL_ENABLE: when write the CHxVAL register, if the write value is same as the CHxVAL value, the write access is ignored
    \param[out] none
    \retval     none
*/
void timer_write_chxval_register_config(uint32_t timer_periph, uint16_t ccsel)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_TIMER_PERIPH(timer_periph)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0047U), ERR_PERIPH);
    } else if(NOT_TIMER_CHVSEL_CCSEL(ccsel)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0047U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if(TIMER_CHVSEL_ENABLE == ccsel) {
            TIMER_CFG(timer_periph) |= (uint32_t)TIMER_CFG_CHVSEL;
        } else if(TIMER_CHVSEL_DISABLE == ccsel) {
            TIMER_CFG(timer_periph) &= (~(uint32_t)TIMER_CFG_CHVSEL);
        } else {
            /* illegal parameters */
        }
    }
}

/*!
    \brief      configure TIMER output value selection
    \param[in]  timer_periph: TIMERx(x=0,7,14~16,40~44)
    \param[in]  outsel: output value selection
                only one parameter can be selected which is shown as below:
      \arg        TIMER_OUTSEL_DISABLE: no effect
      \arg        TIMER_OUTSEL_ENABLE: if POEN and IOS is 0, the output disabled
    \param[out] none
    \retval     none
*/
void timer_output_value_selection_config(uint32_t timer_periph, uint16_t outsel)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_TIMER_PERIPH(timer_periph)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0048U), ERR_PERIPH);
    } else if(NOT_TIMER_OUTSEL(outsel)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0048U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if(TIMER_OUTSEL_ENABLE == outsel) {
            TIMER_CFG(timer_periph) |= (uint32_t)TIMER_CFG_OUTSEL;
        } else if(TIMER_OUTSEL_DISABLE == outsel) {
            TIMER_CFG(timer_periph) &= (~(uint32_t)TIMER_CFG_OUTSEL);
        } else {
            /* illegal parameters */
        }
    }
}

/*!
    \brief      configure commutation control shadow register update selection
    \param[in]  timer_periph: TIMERx(x=0,7,14~16,40~44)
    \param[in]  cssel: commutation control shadow register selection
                only one parameter can be selected which is shown as below:
      \arg        TIMER_CCUSEL_DISABLE: the shadow registers update when the counter generates an overflow/ underflow event
      \arg        TIMER_CCUSEL_ENABLE: the shadow registers update when the counter generates an overflow/ underflow event and the repetition counter value is zero
    \param[out] none
    \retval     none
*/
void timer_commutation_control_shadow_register_config(uint32_t timer_periph, uint16_t ccssel)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_TIMER_PERIPH(timer_periph)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0049U), ERR_PERIPH);
    } else if(NOT_TIMER_CCUSEL_CCSSEL(ccssel)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0049U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if(TIMER_CCUSEL_ENABLE == ccssel) {
            TIMER_CFG(timer_periph) |= (uint32_t)TIMER_CFG_CCUSEL;
        } else if(TIMER_CCUSEL_DISABLE == ccssel) {
            TIMER_CFG(timer_periph) &= (~(uint32_t)TIMER_CFG_CCUSEL);
        } else {
            /* illegal parameters */
        }
    }
}

/*!
    \brief      configure TIMER output match pulse selection
    \param[in]  timer_periph: TIMERx(x=0~4,7,14,22,23,40~44))
    \param[in]  channel: TIMER channel
                only one parameter can be selected which is shown as below:
      \arg        TIMER_CH_0: TIMER channel 0(TIMERx(x=0~4,7,14,22,23,40~44))
      \arg        TIMER_CH_1: TIMER channel 1(TIMERx(x=0~4,7,14,22,23,40~44))
      \arg        TIMER_CH_2: TIMER channel 2(TIMERx(x=0~4,7,22,23))
      \arg        TIMER_CH_3: TIMER channel 3(TIMERx(x=0~4,7,22,23))
    \param[in]  pulsesel: output match pulse selection
                only one parameter can be selected which is shown as below:
      \arg        TIMER_PULSE_OUTPUT_NORMAL: channel output normal
      \arg        TIMER_PULSE_OUTPUT_CNT_UP: pulse output only when counting up
      \arg        TIMER_PULSE_OUTPUT_CNT_DOWN: pulse output only when counting down
      \arg        TIMER_PULSE_OUTPUT_CNT_BOTH: pulse output when counting up or down
    \param[out] none
    \retval     none
*/
void timer_output_match_pulse_select(uint32_t timer_periph, uint32_t channel, uint16_t pulsesel)
{
    uint32_t reg;
    reg  = TIMER_CTL2(timer_periph);
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_TIMER_PERIPH(timer_periph)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x004AU), ERR_PERIPH);
    } else if(NOT_TIMER_CHANNEL(channel)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x004AU), ERR_PARAM_INVALID);
    } else if(NOT_TIMER_PLUSE_OUTPUT(pulsesel)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x004AU), ERR_PARAM_INVALID);
    }else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        switch(channel) {
        /* configure TIMER_CH_0 */
        case TIMER_CH_0:
            reg &= (~(uint32_t)((uint32_t)TIMER_PULSE_OUTPUT_MASK << 8U));
            reg |= (uint32_t)((uint32_t)pulsesel << 8U);
            break;
        /* configure TIMER_CH_1 */
        case TIMER_CH_1:
            reg &= (~(uint32_t)((uint32_t)TIMER_PULSE_OUTPUT_MASK << 10U));
            reg |= (uint32_t)((uint32_t)pulsesel << 10U);
            break;
        /* configure TIMER_CH_2 */
        case TIMER_CH_2:
            reg &= (~(uint32_t)((uint32_t)TIMER_PULSE_OUTPUT_MASK << 12U));
            reg |= (uint32_t)((uint32_t)pulsesel << 12U);
            break;
        /* configure TIMER_CH_3 */
        case TIMER_CH_3:
            reg &= (~(uint32_t)((uint32_t)TIMER_PULSE_OUTPUT_MASK << 14U));
            reg |= (uint32_t)((uint32_t)pulsesel << 14U);
            break;
        default:
            break;
        }
        TIMER_CTL2(timer_periph) = reg;
    }
}

/*!
    \brief      configure the TIMER composite PWM mode
    \param[in]  timer_periph: TIMERx(x=0~4,7,14,22,23,40~44))
    \param[in]  channel: TIMER channel
                only one parameter can be selected which is shown as below:
      \arg        TIMER_CH_0: TIMER channel 0(TIMERx(x=0~4,7,14,22,23,40~44))
      \arg        TIMER_CH_1: TIMER channel 1(TIMERx(x=0~4,7,14,22,23,40~44))
      \arg        TIMER_CH_2: TIMER channel 2(TIMERx(x=0~4,7,22,23))
      \arg        TIMER_CH_3: TIMER channel 3(TIMERx(x=0~4,7,22,23))
    \param[in]  newvalue: ENABLE or DISABLE
    \param[out] none
    \retval     none
*/
void timer_channel_composite_pwm_mode_config(uint32_t timer_periph, uint32_t channel, ControlStatus newvalue)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_TIMER_PERIPH(timer_periph)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x004BU), ERR_PERIPH);
    } else if(NOT_TIMER_CHANNEL(channel)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x004BU), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if(ENABLE == newvalue) {
            TIMER_CTL2(timer_periph) |= (uint32_t)(TIMER_CTL2_CH0CPWMEN << channel);
        } else {
            TIMER_CTL2(timer_periph) &= (~(uint32_t)(TIMER_CTL2_CH0CPWMEN << channel));
        }
    }
}

